Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J21.PIC
      <edc:SFRDef edc:_addr="0x4001409C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="TC_CHANNEL2TC2_RC" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="RC" edc:desc="Register C" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140A0" edc:access="-------------rrr--------rrrrrrrr" edc:cname="TC_CHANNEL2TC2_SR" edc:impl="0x700FF" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger Status (cleared on read)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CLKSTA" edc:desc="Clock Enabling Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTIOA" edc:desc="TIOAx Mirror" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTIOB" edc:desc="TIOBx Mirror" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140A4" edc:access="------------------------wwwwwwww" edc:cname="TC_CHANNEL2TC2_IER" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140A8" edc:access="------------------------wwwwwwww" edc:cname="TC_CHANNEL2TC2_IDR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140AC" edc:access="------------------------rrrrrrrr" edc:cname="TC_CHANNEL2TC2_IMR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="COVFS" edc:desc="Counter Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:desc="Load Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:desc="RA Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:desc="RB Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:desc="RC Compare" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:desc="RA Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:desc="RB Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:desc="External Trigger" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140B0" edc:access="-----------------------n--nn--nn" edc:cname="TC_CHANNEL2TC2_EMR" edc:impl="0x133" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="TRIGSRCA" edc:desc="Trigger Source for Input A" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOAx" edc:desc="The trigger/capture input A is driven by external pin TIOAx" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="The trigger/capture input A is driven internally by PWMx" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TRIGSRCB" edc:desc="Trigger Source for Input B" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="EXTERNAL_TIOBx" edc:desc="The trigger/capture input B is driven by external pin TIOBx" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PWMx" edc:desc="For TC0 to TC10: The trigger/capture input B is driven internally by the comparator output (see Figure 7-16) of the PWMx.For TC11: The trigger/capture input B is driven internally by the GTSUCOMP signal of the Ethernet MAC (GMAC)." edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NODIVCLK" edc:desc="No Divided Clock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400140B4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400140C0" edc:access="-------------------------------w" edc:cname="TC2_BCR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchro Command" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400140C4" edc:access="------nnnnnn--nnnnnnnnnn--nnnnnn" edc:cname="TC2_BMR" edc:impl="0x3F3FF3F" edc:nzwidth="0x20" ltx:memberofperipheral="TC2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:desc="External Clock Signal 0 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:desc="External Clock Signal 1 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:desc="External Clock Signal 2 Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="QDEN" edc:desc="Quadrature Decoder Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSEN" edc:desc="Position Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPEEDEN" edc:desc="Speed Enabled" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QDTRANS" edc:desc="Quadrature Decoding Transparent" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EDGPHA" edc:desc="Edge on PHA Count Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVA" edc:desc="Inverted PHA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVB" edc:desc="Inverted PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVIDX" edc:desc="Inverted Index" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:desc="Swap PHA and PHB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXPHB" edc:desc="Index Pin is PHB Pin" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MAXFILT" edc:desc="Maximum Filter" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
