Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J21.PIC
      <edc:SFRDef edc:_addr="0x400385B0" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR8" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPIS" edc:desc="Transmitted SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDIS" edc:desc="Received STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385B4" edc:access="-------------------w----wwwwwwww" edc:cname="USBHS_HSTPIPIFR9" edc:impl="0x10FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:desc="Received IN Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:desc="Transmitted OUT Data Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPIS" edc:desc="Transmitted SETUP Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:desc="Pipe Error Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:desc="NAKed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:desc="Overflow Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDIS" edc:desc="Received STALLed Interrupt Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:desc="Short Packet Interrupt Set" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:desc="Number of Busy Banks Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400385B8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400385C0" edc:access="-------------rrr-r-r----rrrrrrrr" edc:cname="USBHS_HSTPIPIMR0" edc:impl="0x750FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPE" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDE" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385C4" edc:access="-------------rrr-r-r----rrrrrrrr" edc:cname="USBHS_HSTPIPIMR1" edc:impl="0x750FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPE" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDE" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385C8" edc:access="-------------rrr-r-r----rrrrrrrr" edc:cname="USBHS_HSTPIPIMR2" edc:impl="0x750FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPE" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDE" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385CC" edc:access="-------------rrr-r-r----rrrrrrrr" edc:cname="USBHS_HSTPIPIMR3" edc:impl="0x750FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPE" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDE" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400385D0" edc:access="-------------rrr-r-r----rrrrrrrr" edc:cname="USBHS_HSTPIPIMR4" edc:impl="0x750FF" edc:nzwidth="0x20" ltx:memberofperipheral="USBHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:desc="Received IN Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:desc="Transmitted OUT Data Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXSTPE" edc:desc="Transmitted SETUP Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:desc="Pipe Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:desc="NAKed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:desc="Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXSTALLDE" edc:desc="Received STALLed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:desc="Short Packet Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:desc="Number of Busy Banks Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:desc="FIFO Control" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:desc="Pipe Interrupts Disable HDMA Request Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:desc="Pipe Freeze" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:desc="Reset Data Toggle" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
