Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.23/samv71/edc/ATSAMV71J21.PIC
      <edc:SFRDef edc:_addr="0x400E0704" edc:access="---wwwww--wwwwwwwwwwwwwww-w-wwww" edc:cname="PMC_PCDR1" edc:impl="0x1F3FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral Clock 32 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral Clock 33 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral Clock 34 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral Clock 35 Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral Clock 37 Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral Clock 39 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral Clock 40 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral Clock 41 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral Clock 42 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral Clock 43 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral Clock 44 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral Clock 45 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral Clock 46 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral Clock 47 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral Clock 48 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral Clock 49 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral Clock 50 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral Clock 51 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral Clock 52 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral Clock 53 Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral Clock 56 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral Clock 57 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral Clock 58 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral Clock 59 Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral Clock 60 Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0708" edc:access="---rrrrr--rrrrrrrrrrrrrrr-r-rrrr" edc:cname="PMC_PCSR1" edc:impl="0x1F3FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral Clock 32 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral Clock 33 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral Clock 34 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral Clock 35 Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral Clock 37 Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral Clock 39 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral Clock 40 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral Clock 41 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral Clock 42 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral Clock 43 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral Clock 44 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral Clock 45 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral Clock 46 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral Clock 47 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral Clock 48 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral Clock 49 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral Clock 50 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral Clock 51 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral Clock 52 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral Clock 53 Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral Clock 56 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral Clock 57 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral Clock 58 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral Clock 59 Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral Clock 60 Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E070C" edc:access="--nnnnnnnnnn-------n-nnn-nnnnnnn" edc:cname="PMC_PCR" edc:impl="0x3FF0177F" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID" edc:desc="Peripheral ID" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLKCSS" edc:desc="Generic Clock Source Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="SLCK is selected" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="MAINCK is selected" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLACK is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UPLL_CLK" edc:desc="UPLLCK is selected" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_CLK" edc:desc="MCK is selected" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="GCLKDIV" edc:desc="Generic Clock Division Ratio" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="EN" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLKEN" edc:desc="Generic Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0710" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMC_OCR" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CAL4" edc:desc="Main RC Oscillator Calibration Bits for 4 MHz" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SEL4" edc:desc="Selection of Main RC Oscillator Calibration Bits for 4 MHz" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL8" edc:desc="Main RC Oscillator Calibration Bits for 8 MHz" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SEL8" edc:desc="Selection of Main RC Oscillator Calibration Bits for 8 MHz" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL12" edc:desc="Main RC Oscillator Calibration Bits for 12 MHz" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="SEL12" edc:desc="Selection of Main RC Oscillator Calibration Bits for 12 MHz" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0714" edc:access="wwwwwwwwwwwwwwwwwwwwwwwww-------" edc:cname="PMC_SLPWK_ER0" edc:impl="0xFFFFFF80" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:desc="Peripheral 7 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral 8 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral 9 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral 10 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral 11 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral 12 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral 13 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral 14 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral 15 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral 16 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral 17 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral 18 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral 19 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral 20 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral 21 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral 22 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral 23 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral 24 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral 25 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral 26 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral 27 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral 28 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral 29 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:desc="Peripheral 30 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:desc="Peripheral 31 SleepWalking Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0718" edc:access="wwwwwwwwwwwwwwwwwwwwwwwww-------" edc:cname="PMC_SLPWK_DR0" edc:impl="0xFFFFFF80" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:desc="Peripheral 7 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral 8 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral 9 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral 10 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral 11 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral 12 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral 13 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral 14 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral 15 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral 16 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral 17 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral 18 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral 19 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral 20 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral 21 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral 22 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral 23 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral 24 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral 25 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral 26 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral 27 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral 28 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral 29 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:desc="Peripheral 30 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:desc="Peripheral 31 SleepWalking Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
